/*
  Напишите функцию validate которая проверяет поле формы
  номера телефона tel и возвращает результат в виде обьекта
  со свойством tel.

  Кроме того, формат объекта: в свойства записывается буль-флаг
  уведомляющий о статусе прохождения валидации для поля.
  {
    tel: true или false,
  }

  Критерии валидации:
  1) Правильный формат записи начинается с + и содержит 12 цифр от 0 до 9.

  2) При вводе допускаются пробелы или дефисы между любыми цифрами.

  3) При выводе номер должен быть отформатирован в том же стиле что и номер
  в placeholder

  При клике на кнопку submit должна происходить проверка.
  Результат проверки, объект и результирующий номер телефона
  в правильном фонрмате, выводить в консоль.
*/

const tel = document.getElementById("tel");
const submit = document.querySelector(".btn");
submit.addEventListener("click", validate);

function validate(evt) {
  evt.preventDefault();

  const userPhone = {
    tel:''
  }
  const rightTel = /\+(\d{3})(-|\s)(\d{2})(-|\s)(\d{2})(-|\s)(\d{2})(-|\s)(\d{3})/;
  userPhone.tel = rightTel.test(tel.value);
  console.log(userPhone);
}
